In [1]:
import pandas as pd

# series

In [9]:
carcolor=pd.Series(['Red','Green','blue'])

In [7]:
carname=pd.Series(['BMW','Toyota','tesla'])

In [8]:
car=pd.DataFrame({"Carcolor":carcolor,"Carname":carname})

In [202]:
studentdata=pd.read_csv("studentdata.csv")
# studentdata

In [13]:
a=studentdata.dtypes
# a

In [15]:
a=studentdata.columns
# a

In [18]:
a=studentdata.index
# a

In [20]:
a=studentdata.describe()   #describes onlu numeric values i.e age
# a

In [26]:
a=studentdata.info()

In [29]:
a=studentdata.mean(numeric_only=True)  #mean of only numeric value i.e age
# a

In [32]:
a=studentdata["Age"].sum().item()
# a

In [34]:
a=len(studentdata)
# a

In [40]:
studentdata.to_csv("Exported.csv",index=False)
exporteddata=pd.read_csv("Exported.csv")
# exporteddata

# Viewing and Selecting data

In [45]:
# studentdata.head()   #top 5 by default
# studentdata.head(2)   #top 2
# studentdata.tail()   #bottom 5 by default
# studentdata.tail(3)    #bottom3
# studentdata.loc[2]      #refers to value with index 2 (can be multiple)
# studentdata.loc[:3]     #returns upto 3 index number (can be more than 3)
# studentdata.iloc[2]     #refers to position 3 irrespective of index number
# studentdata.iloc[:2]     #returns uptop 2 position i.e 3 numbers

In [55]:
# studentdata[studentdata["Age"]==22]  #viewing rows who has age==22

In [57]:
# Crosstab
a=pd.crosstab(studentdata['Name'],studentdata['Age'])
# a

In [66]:
#groubby--- group any column and apply operation
# studentdata.groupby(['Name']).mean(numeric_only=True)

In [73]:
#plot, histogram
# studentdata['Age'].plot()  #only numeric data
# studentdata['Age'].hist()

In [76]:
# studentdata['price'].plot()

In [135]:
studentdata['price']=studentdata['price'].astype(str).str.replace(r'[\$]','',regex=True).astype(int)
# studentdata

# Manipulating Data

In [134]:
studentdata['Name'].str.lower()

In [133]:
# studentdata['Age'].mean(numeric_only=True).item()
studentdata['Age']=studentdata['Age'].fillna(studentdata['Age'].mean(numeric_only=True))
# studentdata

In [130]:
studentdata.dropna(inplace=True)

In [168]:
std_marks=pd.Series([200,570,480,398,300])
studentdata['Marks']=std_marks
# studentdata

In [144]:
studentdata['Age']=studentdata['Age'].fillna(33)
# studentdata

In [145]:
studentdata['Rank']=['5th','4th','3rd','2nd','1st']

In [166]:
# studentdata?

In [165]:
studentdata['Percentage']=(studentdata['Marks']/600)*100
# studentdata

In [162]:
studentdata['number']=4
# studentdata

In [205]:
# removing column
studentdata=studentdata.drop("number",axis=1)
# studentdata

In [171]:
studentdatashuffled=studentdata.sample(frac=1)

In [173]:
#only select 20% of data
a=studentdatashuffled.sample(frac=0.2)
a

   Name   Age Location price  Marks Rank  Percentage
4  Hari  33.0  pokhara   NaN    300  1st        50.0

In [204]:
studentdata.reset_index(drop=True,inplace=True)
studentdata

     Name   Age       Location  price
0  Anisha  22.0  Thulobharyang  $200
1  Ashish  23.0            ktm  $400
2     Ram  35.0     basundhara  $300
3    Sita  22.0        chitwan  $600
4    Hari   NaN        pokhara    NaN